{
  "backend/main.mo": "Empty Motoko actor placeholder with no functionality.",
  "feature_evidence.json": "Feature evidence report listing UI rebrand, text updates, asset changes, and theme configuration with associated files and metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend components, styles, and hooks in the project.",
  "frontend/index.css": "Tailwind base setup defining OKLCH theme variables for light and dark modes with global background and text utilities.",
  "frontend/index.html": "Basic HTML entry point loading the React app and setting page metadata.",
  "frontend/src/App.tsx": "Main app component managing prize flow steps and state transitions across lookup, activation, eligibility, identity, receipt, and completion.",
  "frontend/src/components/ActivationFlow.tsx": "Prize activation screen displaying prize details and a simulated activation process with premium styling.",
  "frontend/src/components/CompletionScreen.tsx": "Final status screen showing claimed, under‑review, or ineligible states with themed icons, messages, and optional background art.",
  "frontend/src/components/EligibilityFlow.tsx": "Displays eligibility requirements with checkboxes and submits completion once all items are confirmed.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with dynamic year and a referral link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the top navigation header with the app logo and title.",
  "frontend/src/components/IdentityVerification.tsx": "Handles face photo and ID card uploads with previews and validation before submitting identity verification.",
  "frontend/src/components/PrizeLookup.tsx": "Lets users enter a prize number, validates it, and returns mock prize data after a simulated backend call.",
  "frontend/src/components/ReceiptMethod.tsx": "Collects the user's preferred delivery method and associated email or address before submitting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using Dfinity AuthClient, exposing identity state and login/logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines placeholder React Query hooks for prize-related backend calls, using an actor once available and invalidating prize info queries on mutations.",
  "frontend/src/index.css": "Configures Tailwind base styles and custom Prize Portal light/dark theme variables, plus utility classes like premium glow effects.",
  "frontend/src/main.tsx": "Initializes the app root, wrapping App with React Query and Internet Identity providers and loading global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, shadows, and animations using Prize Portal design tokens.",
  "project_state.json": "Project state metadata describing the Prize Portal rebrand, required assets, and existing feature requirements."
}