{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature report JSON stub with no features listed.",
  "frontend-file-summaries.txt": "Contains textual summaries for all major frontend components and config files.",
  "frontend/index.css": "Tailwind base file defining OKLCH color variables and theming for light/dark modes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component controlling prize verification flow and state transitions.",
  "frontend/src/components/ActivationFlow.tsx": "User interface for activating a verified prize number with simulated backend call.",
  "frontend/src/components/CompletionScreen.tsx": "Displays final prize status such as ineligible, pending review, or claimed.",
  "frontend/src/components/EligibilityFlow.tsx": "Checklist-based eligibility confirmation interface before identity verification.",
  "frontend/src/components/Footer.tsx": "Footer with copyright notice and caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Header with logo and title branding the Winner Verification Portal.",
  "frontend/src/components/IdentityVerification.tsx": "React component for uploading and validating face and ID photos, showing previews, errors, and submitting verification.",
  "frontend/src/components/PrizeLookup.tsx": "Form to enter and validate a prize number, simulating a backend lookup and returning mock prize data.",
  "frontend/src/components/ReceiptMethod.tsx": "Collects user delivery details for physical or digital prize receipt with form validation and simulated submission.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Placeholder React Query hooks for backend prize operations, wired to actor but returning mock/null data for now.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for light and dark theme design tokens.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with typography, container queries, custom colors, fonts, animations, and extended theme settings.",
  "project_state.json": "Defines project state, rebuild requirements, deployment issues, and lists existing features for the prize‑winner verification app."
}