{
  "backend/main.mo": "Minimal Motoko canister actor with no implemented logic.",
  "feature_evidence.json": "JSON report listing implemented TikTok-themed UI features, affected files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s role and TikTok-themed styling updates.",
  "frontend/index.css": "Global Tailwind base layers defining color tokens, dark mode variables, and shared border/background utilities.",
  "frontend/index.html": "Base HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app orchestrating all verification steps and transitioning flow stages based on prize status.",
  "frontend/src/components/ActivationFlow.tsx": "Activation step UI showing prize details and triggering prize activation with neon-themed styling.",
  "frontend/src/components/CompletionScreen.tsx": "Completion UI showing ineligible, claimed, or pending-review states with themed status indicators and reset option.",
  "frontend/src/components/EligibilityFlow.tsx": "Renders a checklist-based eligibility confirmation flow and triggers completion after validating all items are checked.",
  "frontend/src/components/Footer.tsx": "Displays a footer with copyright info and a referral link including the app hostname.",
  "frontend/src/components/Header.tsx": "Shows the top header with the app logo and title for the verification portal.",
  "frontend/src/components/IdentityVerification.tsx": "Handles face and ID image uploads with validation, previews, and submission for identity verification.",
  "frontend/src/components/PrizeLookup.tsx": "Provides a form to enter a prize number, mocks backend validation, and returns prize data on success.",
  "frontend/src/components/ReceiptMethod.tsx": "Collects delivery method and recipient details, validating required fields before submitting delivery information.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for managing Internet Identity authentication, including login, logout, and identity restoration. Wraps AuthClient creation and exposes status flags and identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for prize-related backend operations, currently stubbed with placeholder logic pending backend integration. Includes queries and mutations for fetching prize info and submitting various user actions.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines a TikTok-like dark theme using CSS variables, along with custom glow utility classes. Applies global background, text, and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider. Loads global styles and renders the root App component.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors mapped to CSS variables, extended shadows, fonts, animations, and plugins. Enables responsive containers and neon-themed UI extensions.",
  "project_state.json": "Describes the project’s configuration, current feature set, and image update requirements for applying a TikTok-like neon UI theme. Tracks feature versions and pending requests."
}